'use strict';

// ID ресурсов
export const RES = {
  IRON: 1, COPPER: 2, COAL: 3,
  PLATE_IRON: 4, PLATE_COPPER: 5,
  WIRE: 6, GEAR: 7, CORPS: 8, CIRCUIT: 9, ENGINE: 10, POWDER: 11, AMMO: 12,
  // 1 эпоха (Твёрдые)
  STONE: 13, CLAY: 14,
  // 1 эпоха (Биомасса / Жидкости)
  WOOD: 15, WATER: 16, OIL: 17,
  // 2 эпоха
  BAUXITE: 18, LEAD: 19, TIN: 20, ZINC: 21,
  // 3 эпоха
  TITANIUM: 22, TUNGSTEN: 23, URANIUM: 24, SILICON: 25
};

export const RES_NAME = {
  1: 'Железо', 2: 'Медь', 3: 'Уголь',
  4: 'Жел. плиты', 5: 'Медные плиты', 6: 'Провод', 7: 'Шестерня', 8: 'Корпус',
  9: 'Схема', 10: 'Двигатель', 11: 'Порох', 12: 'Патроны',
  13: 'Камень', 14: 'Глина', 15: 'Дерево', 16: 'Вода', 17: 'Нефть',
  18: 'Бокситы', 19: 'Свинец', 20: 'Олово', 21: 'Цинк',
  22: 'Титан', 23: 'Вольфрам', 24: 'Уран', 25: 'Кремний'
};

export const RES_COLOR = {
  1: '#c87d5e', 2: '#e89a4a', 3: '#555555',
  4: '#c0c0d0', 5: '#ff8844', 6: '#c08040', 7: '#888888', 8: '#606060',
  9: '#40a040', 10: '#a040a0', 11: '#202020', 12: '#c0a040',
  13: '#888888', 14: '#a07050', 15: '#5a3a1a', 16: '#3080d0', 17: '#111111',
  18: '#e0a080', 19: '#606080', 20: '#909090', 21: '#708090',
  22: '#c0c0e0', 23: '#404050', 24: '#40a040', 25: '#805020'
};

// Тир бура, которым копается ресурс (1 - обычный, 2 - электрический, 3 - лазерный)
export const RES_TIER = {
  1: 1, 2: 1, 3: 1, 13: 1, 14: 1, // 1 эпоха (твёрдые)
  18: 2, 19: 2, 20: 2, 21: 2,     // 2 эпоха
  22: 3, 23: 3, 24: 3, 25: 3      // 3 эпоха
};

// Является ли ресурс жидким (для генерации пятен) или это биомасса
export const RES_TYPE = {
  15: 'wood', 16: 'water', 17: 'oil',
  13: 'stone', 14: 'clay'
};